package com.cisdi.data.misc;

import lombok.extern.slf4j.Slf4j;

import java.io.File;

@Slf4j
public class CreateFolers {
    static String[] ss = new String[]{
            "01立项申请及批复",
            "02可研估算",
            "03初设概算",
            "04征地调查",
            "05农转用手续办理",
            "06林地调整手续办理",
            "07用地规划许可",
            "08土地划拨",
            "09土地证办理",
            "10工程规划许可",
            "11人防规划报建",
            "12施工许可",
            "13人防施工报建",
            "14国安报建",
            "15环评",
            "16水保方案",
            "18社会稳定性评价",
            "19固定资产投资节能评价",
            "20白蚁防治",
            "21防洪评价",
            "22交通安全评价",
            "23设计任务书",
            "24概念方案设计管理",
            "24方案设计管理",
            "25施工图设计管理",
            "26设计交底与图纸会审",
            "27招标核准",
            "28采购需求审批",
            "29招标文件审批",
            "30标前资料用印审批",
            "31中选单位及标后用印审批",
            "32招采项目备案及归档",
            "33合同签订",
            "34补充协议",
            "35合同变更",
            "36合同终止",
            "37预算财评",
            "38工程付款申请",
            "39资金需求计划",
            "40新增保函",
            "41保函退还申请",
            "42施工组织设计及施工方案",
            "43工程开工报审",
            "44耕作层剥离",
            "45设计变更",
            "46五方责任主体及终身质量承诺书",
            "47监理规划及细则",
            "48施工进度计划",
            "49工作联系单",
            "50报审、报验",
            "51工程索赔通知书",
            "52费用索赔报审表",
            "53质量交底记录表",
            "54工程质量检查记录表",
            "55科研材料设备进场验收",
            "56合同品牌变更申请",
            "57工程材料设备及品牌报审表",
            "58工程材料设备进场验收单",
            "59材料退场",
            "60竣工验收",
            "61监理通知单",
            "62监理通知回复单",
            "63开工令",
            "64工程暂停令",
            "65工程复工令",
            "66工程复工报审表",
            "67分包单位资质报审表",
            "68竣工联合验收意见",
            "69用章审批",
            "70发文呈批"
    };

    public static void main(String[] args) {
        String p = "D:\\zx\\2206-三亚\\221025-资料\\整理后";
        if (ss != null) {
            for (String s : ss) {
                String dir = p + "\\" + s;
                boolean succ = new File(dir).mkdir();
                if (succ) {
                    log.info("成功创建文件夹：" + dir);
                }
            }
        }
    }
}
